In [1]:
import pandas as pd

In [2]:
pwd

'C:\\Users\\defaultuser0\\pandas and numpy'

In [ ]:
pd.read_csv('\\')

In [ ]:
b= pd.read_csv('/')

In [3]:
# writing in csv files

In [4]:
d = {'name':['kashi','binod','diraj'],
    'score':[100,56,67],
    'number':[34,66,68]}

In [5]:
d

{'name': ['kashi', 'binod', 'diraj'],
 'score': [100, 56, 67],
 'number': [34, 66, 68]}

In [6]:
df = pd.DataFrame(d)

In [7]:
df

    name  score  number
0  kashi    100      34
1  binod     56      66
2  diraj     67      68

In [8]:
# now save it in csv file

In [9]:
df.to_csv('test2.csv')

In [10]:
pwd

'C:\\Users\\defaultuser0\\pandas and numpy'

In [12]:
pd.read_csv("C:\\Users\\defaultuser0\\pandas and numpy\\test2.csv")

   Unnamed: 0   name  score  number
0           0  kashi    100      34
1           1  binod     56      66
2           2  diraj     67      68

In [13]:
# here unwanted index is added here to remove it index_col=o
pd.read_csv("C:\\Users\\defaultuser0\\pandas and numpy\\test2.csv", index_col=0)

    name  score  number
0  kashi    100      34
1  binod     56      66
2  diraj     67      68

# reading and writing excel files

In [ ]:
pd.read_excel('/',index_col=0,sheet_name='sheet1')

In [14]:
# writing in excel

In [15]:
df

    name  score  number
0  kashi    100      34
1  binod     56      66
2  diraj     67      68

In [16]:
df.to_excel('test_2.xlsx',sheet_name='Sheet1')

In [17]:
pwd

'C:\\Users\\defaultuser0\\pandas and numpy'

In [18]:
pd.read_excel('C:\\Users\\defaultuser0\\pandas and numpy\\test_2.xlsx')

   Unnamed: 0   name  score  number
0           0  kashi    100      34
1           1  binod     56      66
2           2  diraj     67      68

In [19]:
pd.read_excel('C:\\Users\\defaultuser0\\pandas and numpy\\test_2.xlsx',index_col=0)

    name  score  number
0  kashi    100      34
1  binod     56      66
2  diraj     67      68